#language:ru
@all

Функционал:

  Сценарий:

    * Перейти на сайт "https://render.run"
    * Проверить что в футере отображается текст "3D визуализация жилых помещений"
    * Кликнуть по ссылке "о себе"
    * Проверить что на странице отображается текст, содержащий слова "Здравствуйте! Меня зовут Алена"
    * Проверить что в футере отображается текст "3D визуализация жилых помещений"
    * Кликнуть по ссылке "проекты"
    * Проверить, что на странице отображается "8" изображений
    * Проверить что в футере отображается текст "3D визуализация жилых помещений"
    * Кликнуть на любое изображение
    * Проверить, что отображается текст "В создании проекта использованы следующие инструменты:"
    * Проверить что в футере отображается текст "3D визуализация жилых помещений"
    * Кликнуть по ссылке "контакты"
    * Проверить что в футере отображается текст "krasnova@render.run +7(999)873-60-79"
    * Заполнить поля:
      | имя        | Тестовое имя                                                                 |
      | email      | test@test.ru                                                                 |
      | телефон    | 89993334455                                                                  |
      | ваш вопрос | Проводится тестирование функциональности. Просьба не отвечать на это письмо. |

    * Нажать на кнопку "отправить"
    * Проверить, что после отправки отображается текст "Спасибо. Ваше сообщение успешно отправлено."